In [2]:
import pandas as pd

In [3]:
s = pd.Series([12,29,72,4])
print (s)

0    12
1    29
2    72
3     4
dtype: int64

In [4]:
fruits = ['apple', 'orange','pear']
quant = [15,33,45]

# type(fruits)
# type('apple')

s = pd.Series(quant, index = fruits)
print (s)

apple     15
orange    33
pear      45
dtype: int64

In [5]:
fruits = {'apple': [4,3,1,0],
          'banana':[0,4,6,2],
          'orange':[1,5,2,4],

}

df = pd.DataFrame(fruits)
df

   apple  banana  orange
0      4       0       1
1      3       4       5
2      1       6       2
3      0       2       4

In [6]:
cities = ['a','b','c','d']
df = pd.DataFrame(fruits, index = cities)
df

   apple  banana  orange
a      4       0       1
b      3       4       5
c      1       6       2
d      0       2       4

In [7]:
df = pd.DataFrame(fruits, columns=['banana', 'apple','orange'], index = cities)
df

   banana  apple  orange
a       0      4       1
b       4      3       5
c       6      1       2
d       2      0       4

In [8]:
df.columns = ['banana', 'apple','orange']
cities[2] = 'e'
df.index = cities
df

   banana  apple  orange
a       0      4       1
b       4      3       5
e       6      1       2
d       2      0       4

In [9]:
df.T

        a  b  e  d
banana  0  4  6  2
apple   4  3  1  0
orange  1  5  2  4

In [10]:
df.head(2)
df.tail(2)

   banana  apple  orange
e       6      1       2
d       2      0       4

In [11]:
print(df.index)
print(df.columns)
print(df.values)

Index(['a', 'b', 'e', 'd'], dtype='object')
Index(['banana', 'apple', 'orange'], dtype='object')
[[0 4 1]
 [4 3 5]
 [6 1 2]
 [2 0 4]]

In [12]:
for index, row in df.iterrows():
    print (index, row['apple'], row['banana'], row['orange'])

a 4 0 1
b 3 4 5
e 1 6 2
d 0 2 4

In [14]:
df.iloc[1,1]

3

In [15]:
for i in range(5):
    print (i)

0
1
2
3
4

In [18]:
data1 = [0]*10
print (data1)

[0, 0, 0, 0, 0, 0, 0, 0, 0, 0]

In [25]:
for i in range(5):
    data1[i] = (data1[i])*2
print (data1)

[0, 0, 0, 0, 0, 0, 0, 0, 0, 0]